Revit 2024 API
LinkLoadResult.GetExternalResourceReference Method
 Gets a copy of the ExternalResourceReference corresponding to the link.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Since: 2015
Syntax
C#
public ExternalResourceReference GetExternalResourceReference()
Visual Basic
Public Function GetExternalResourceReference As ExternalResourceReference
Visual C++
public:
ExternalResourceReference^ GetExternalResourceReference()
Return Value
 A copy of the ExternalResourceReference corresponding to the link.
See Also
LinkLoadResult Class
Autodesk.Revit.DB Namespace